In [1]:
# method
# write 'w'
with open('cwpc.txt','w',encoding='utf-8') as file:
    file.write('Welcome to CWPC\n')
    file.writelines(["Line 2\n","Line 3\n"])

In [2]:
# read method 'r'
with open('cwpc.txt','r') as file:
    data=file.read()
    print(data)

Welcome to CWPC
Line 2
Line 3

In [5]:
# append
with open('cwpc.txt','a') as file:
    file.write('\n Welcome to Python learning point')

In [8]:
with open('cwpc.txt','r') as file:
    data=file.read()
    print(data)

Welcome to CWPC
Line 2
Line 3

 Welcome to Python learning point
 Welcome to Python learning point
 Welcome to Python learning point

In [9]:
import pandas as pd
data=pd.read_csv('Employee_Details.csv')
data.head()

,Employee Name,Salary,Dept,Leave Days,City,Date of Birth,Join Date
0,John Smith,50000,HR,12,New York,12-05-1990,01-02-2015
1,Priya Patel,60000,Finance,10,Mumbai,23-11-1988,15-06-2016
2,Alex Johnson,70000,IT,8,London,05-09-1992,10-03-2018
3,Meena Rao,55000,Marketing,14,Bangalore,19-07-1991,21-09-2017
4,David Lee,80000,Operations,9,Singapore,02-01-1985,12-12-2014

In [ ]:
import pandas as pd
data=pd.read_excel('Sample - Superstore.xls')
data.head()

,Unnamed: 0,% OF Grand Total,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,Sum of Sales,Years,NaN,NaN,NaN,NaN
2,Sub-Category,2014,2015.000000,2016.000000,2017.000000,Grand Total
3,Accessories,0.010889,0.017641,0.018238,0.026095,0.072863
4,Appliances,0.006666,0.010117,0.011340,0.018687,0.04681